app/views/avisosms/_send_sms_text.html.erb

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
 <soap:Body>
  <SendTextMessage xmlns="http://sms.avisosms.ru/gate.php">
  <smsUser><%= SiteConfig.avisosms_username %></smsUser>
    <password><%= SiteConfig.avisosms_password %></password>
    <destinationAddress><%= data[:destination_address] %></destinationAddress>
    <messageData><%= data[:message_data] %></messageData>
    <sourceAddress><%= SiteConfig.avisosms_source_address %></sourceAddress>
    <deliveryReport><%= SiteConfig.avisosms_delivery_report %></deliveryReport>
    <flashMessage><%= SiteConfig.avisosms_flash_message %></flashMessage>
    <validityPeriod><%= SiteConfig.avisosms_validity_period %></validityPeriod>
  </SendTextMessage>
 </soap:Body>
</soap:Envelope>
